{"name":"","headerTaglineOne":"Hello 👋","headerTaglineTwo":"My name is Ahmad!","headerTaglineThree":"Your next Full Stack Software Engineer","headerTaglineFour":" Based in New York, NY","showBlog":false,"socials":[{"id":"1","title":"Github","link":"https://github.com/Abdull118"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/ahmadevelops/"},{"id":"3","title":"Twitter","link":"https://twitter.com/ahmadevelops"},{"id":"4","title":"Email","link":"mailto:ahmadevelops@gmail.com"},{"id":"5","title":"Phone","link":"smsto:+13474001820"}],"projects":[{"id":"1","title":"Tenant Score","description":"Landing page for a game-changing tenant seeker experience created using React.js, Styled Components, HTML, CSS, & JS.","imageSrc":"https://i.imgur.com/ImM90wt.png","url":"http://tenant-score.netlify.app"},{"id":"2","title":"No-D NYC (React Native)","description":"No-D NYC is a modern platform that blends community and technology, offering tools for connection, collaboration, and growth. A React Native Application built behind the idea that Drug users, Overdose victims, and the Homeless community of NYC can have easy access to local centers for aid. Stack: React Native, Node.js, MongoDB","imageSrc":"https://i.imgur.com/H19aFrp.jpeg","url":""},{"id":"3","title":"VFluence by Vibranium Network (Blockchain dApp)","description":"V-Fluence is a blockchain app that combines social networking and social media, letting users post tributes and bounties with real monetary rewards in exchange for social media content engagement. Stack: Next.js, Next,js Serverless, Node.js, Solidity, Chainlink, IPFS, AWS, & Docker.","imageSrc":"https://i.imgur.com/YWMKBtx.png","url":"https://vfluencealphaone.vercel.app/"},{"id":"4","title":"Islamic Society of Guelph (TV App)","description":"A cross-platform system built for Android TVs with mobile companion apps to display prayer times, announcements, Hadiths, and notifications. Each screen is shown for a set duration (seconds to minutes), with real-time updates synced from mobile apps. Designed with a TV-optimized UI, clear typography, and accessible layouts for seamless community engagement. Stack: React Native, React, Node.js, MongoDB","imageSrc":"https://i.imgur.com/QLuKBDi.png","url":"https://isog-r-webapp.vercel.app/"},{"id":"6","title":"Islamic Society of Guelph (Website)","description":"Redesigned and developed a responsive, user-friendly platform that streamlines access to prayer times, events, and community resources. The site emphasizes clean navigation, accessible design, and clear information architecture to improve the user experience for a diverse audience. Stack: MERN","imageSrc":"https://i.imgur.com/jQiAUhU.png","url":"https://isofg.ca/"}],"services":[{"id":"1","title":"Web Development","description":"Custom Websites – Responsive, fast, and tailored websites built with modern frameworks.\nE-Commerce – Online stores with secure checkout and easy product management.\nWeb Apps – Scalable applications with intuitive user experiences."},{"id":"2","title":" Responsive Design","description":"Built to look and perform beautifully on all types of devices, with a page structure that is logical and helps users (and search engines) browse efficiently"},{"id":"3","title":"SEO","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":" UI/UX Design","description":"Human-centered approach to all design decisions so that products feel custom built for the target audience and is easy-to-navigate"},{"id":"4c11f576-5612-48f8-b5e6-86eef9448e4a","title":"App Development","description":"iOS & Android Apps – Cross-platform mobile apps with clean UI and smooth performance.\nCompanion Apps – Mobile apps that integrate with web platforms or smart devices.\nPrototyping & MVPs – Rapid development of testable app ideas to validate concepts."},{"id":"a1ee0462-0c2a-4627-b568-b76066782e23","title":"Technical Services","description":"API Integration – Connecting apps with third-party services for added functionality.\nDatabase & Backend – Secure, scalable backends for apps and websites.\nPerformance Optimization – Faster load times, smooth animations, and SEO readiness."},{"id":"5f30c61e-4b9f-4e71-8ecf-3738741eecba","title":"Consulting & Support","description":"Project Consultation – Guidance on turning ideas into actionable development plans.\nCode Reviews – Clean, maintainable codebases that meet industry standards.\nOngoing Support – Updates, bug fixes, and feature improvements post-launch."}],"aboutpara":"Hello, World! My name is Ahmad, and I am a full-stack software engineer focused on the Front End.\n\nMy technology stack includes:\n\nHTML, CSS, TailwindCSS, Styled Components, Javascript, MongoDB, Express.js, React.js, Next.js, Node.js, Firebase, Google Auth, Azure Auth, Azure Machine Learning, PostgreSQL, NoSQL, OOP, Web Accessibility, and much more!"}